UKS/src/Documents/ОбслуживаниеОборудования/ОбслуживаниеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбслуживаниеОборудования</name>
  <comment>Обслуживание оборудования</comment>
  <registerRecords>InformationRegister.ОбслуживаниеОборудования</registerRecords>
  <attributes>
    <name>Оборудование</name>
    <comment>Оборудование</comment>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбслуживания</name>
    <comment>Вид обслуживания</comment>
    <type>
      <types>CatalogRef.ВидыОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание работы</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеРуководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работа</name>
    <comment>Работа</comment>
    <attributes>
      <name>Работа</name>
      <comment>Работа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <comment>Деталь/Узел</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПечать</name>
      <comment>Деталь/Узел</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураИзъятая</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураИзъятаяПечать</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <comment>Основание изъятия</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИзъятого</name>
      <comment>Стоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьУстановленного</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственныеЛицаРемонта</name>
    <attributes>
      <name>Сотрудник</name>
      <comment>Сотрудник</comment>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <comment>Должность</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UKS/src/InformationRegisters/ОбслуживаниеОборудования/ОбслуживаниеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбслуживаниеОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Работа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <comment>Оборудование</comment>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбслуживания</name>
    <comment>ВидОбслуживания</comment>
    <type>
      <types>CatalogRef.ВидыОбслуживания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UKS/src/Documents/ОбслуживаниеОборудования/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОбслуживаниеОборудования
	Движения.ОбслуживаниеОборудования.Записывать = Истина;
	Для Каждого ТекСтрокаРабота Из Работа Цикл
		Движение = Движения.ОбслуживаниеОборудования.Добавить();
		Движение.Оборудование = Оборудование;
		Движение.ВидОбслуживания = ВидОбслуживания;
		Движение.Номенклатура = ТекСтрокаРабота.Номенклатура;
		Движение.Работа = ТекСтрокаРабота.Работа;
		Движение.Период = Дата;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не Проведен Тогда
		Если Работа.Количество()=0 Тогда
			НоваяСтрока = Работа.Добавить();
			НоваяСтрока.Работа = СокрЛП(ВидОбслуживания.Наименование)+". "+СокрЛП(Описание);
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры
